[
    {
        "triggers": [
            "01",
            "1",
            "Old Macdonald has lost his wife",
            "Macdonald",
            "wife"
        ],
        "replies": [
            {
                "reply": "Good choice, Sherlock! \nOld Macdonald's wife has gone missing and we need your help to find her. He believes that the animals on his farm may have some information about her whereabouts. Are you ready for some details I have?",
                "type": "text"
            }
        ]
    },
    {
        "triggers": [
            "yes",
            "ready",
            "I'm ready",
            "details",
            "give me some details"
        ],
        "replies": [
            {
                "reply": "Old Macdonald said that his wife had been acting strange for the past few days, and she seemed to be keeping secrets from him. He also said that she had been spending a lot of time with the animals on the farm. That's why we think the animals may have some clues. Say \"first clue\" or \"give me the clue\" to get the clue I have",
                "type": "text"
            }
        ]
    },
    {
        "triggers": [
            "first",
            "first clue",
            "give me the clue",
            "first clue"
        ],
        "replies": [
            {
                "reply": "Old Macdonald said his wife was planning to get some fresh milk in the morning, any ideas where she could be?",
                "type": "text"
            }
        ]
    },
    {
        "triggers": [
            "cow", "barn", "cow barn", "cows"
        ],
        "replies": [
            {
                "reply": "Yes, brilliant! She might have planned to go to the cow, let's go check the barn! When you're ready say \"second clue\" and I'll ask the cow if she saw anything",
                "type": "text"
            }
        ]
    },

    {
        "triggers": [
            "ask the cow",
            "second clue"
        ],
        "replies": [
            {
                "reply": "The cow says the woman also planned to prepare new yarn for the market. Where could it be?",
                "type": "text"
            }
        ]
    },
    {
        "triggers": [
            "sheep", "sheeps"
        ],
        "replies": [
            {
                "reply": "Great idea! Let's go to the pasture! When we're there, say \"third clue\" and I'll ask the sheep if she can help",
                "type": "text"
            }
        ]
    },
    {
        "triggers": [
            "ask the sheep",
            "third clue"
        ],
        "replies": [
            {
                "reply": "Sheep says she wanted to get some eggs",
                "type": "text"
            }
        ]
    },
    {
        "triggers": [
            "ducks", "duck"
        ],
        "replies": [
            {
                "reply": "Great! Let's run to the pond and ask the ducks! Say \"ask the duck\" to get the next clue!",
                "type": "text"
            }
        ]
    },
    {
        "triggers": [
            "ask the duck"
        ],
        "replies": [
            {
                "reply": "The duck says it's all for the birthday cake! She says we should take Old Mackdonald to the white pavilion and see what's there! What do we do next?",
                "type": "text"
            }
        ]
    },
    {
        "triggers": [
            "pavilion", "go to the pavilion", "let's go to the pavilion"
        ],
        "replies": [
            {
                "reply": " Brilliant! Let's hurry! Do you hear the music? (You should agree here to proceed :)",
                "type": "text"
            }
        ]
    },    
    {
        "triggers": [
            "yes",
            "of course",
            "music",
            "yes, I hear"
        ],
        "replies": [
            {
                "reply": "And look, there's Old Macdonald's wife, she's the one who set up the surprise party for him! Congratulations, you solved it!!",
                "type": "text"
            }
        ]
    }
]